app/views/users/show.html.erb

SELECT "albums".* FROM "albums" WHERE "albums"."user_id" = ?  [["user_id", 1]]
---
  <table>
  <% @user.albums.each do|album| %>