app/views/albums/show.html.erb

SELECT "photos".* FROM "photos" WHERE "photos"."album_id" = ?  [["album_id", 1]]
---
	<div class="row">
  <% @album.photos.each do |photo| %>

SELECT "tags".* FROM "tags" WHERE "tags"."photo_id" = ?  [["photo_id", 38]]
SELECT 1 AS one FROM "tags" WHERE "tags"."photo_id" = ? LIMIT 1  [["photo_id", 38]]
---
		<td>
    <% photo.tags.any? %>