app/views/photos/show.html.erb

<%= image_tag @photo.avatar.url(:large) %><br>
<%= @photo.tags.any? %>
---
SELECT "tags".* FROM "tags" WHERE "tags"."photo_id" = ?  [["photo_id", 38]]
SELECT 1 AS one FROM "tags" WHERE "tags"."photo_id" = ? LIMIT 1  [["photo_id", 38]]