app/controllers/albums_controller.rb

def create
  @user = User.find(params[:user_id])
  @album= @user.albums.create(params[:album])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "albums" ("created_at", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Mon, 26 Aug 2013 12:52:55 UTC +00:00], ["name", "sports"], ["updated_at", Mon, 26 Aug 2013 12:52:55 UTC +00:00], ["user_id", 1]]