app/controllers/photos_controller.rb

def create

  @album=Album.find(params[:album_id])
  @photo=@album.photos.create(params[:photo].permit(:avatar, :tags, :tag_list))
---
SELECT "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "tags" ("name") VALUES (?)  [["name", "in"]]
INSERT INTO `photos` (`album_id`, `avatar_content_type`, `avatar_file_name`, `avatar_file_size`, `avatar_updated_at`, `created_at`, `updated_at`) VALUES (1, 'image/jpeg', 'index.jpeg', 12402, '2013-09-04 13:47:18', '2013-09-04 13:47:19', '2013-09-04 13:47:19')

def tagged
  if params[:tag].present?
    @id = Tag.find_all_by_name( params[:tag]).map(&:photo_id)
    @photos = Photo.find(@id)

  else
    @photos = Photo.all
---
SELECT "tags".* FROM "tags" WHERE (lower(name) = 'in')
SELECT "tags".* FROM "tags" WHERE "tags"."name" = 'rrrr'
SELECT "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", 49]]
SELECT "photos".* FROM "photos"