app/controllers/tags_controller.rb

def create
  @photo = Photo.find(params[:photo_id])
  @tag = @photo.tags.create(params[:tag].permit(:name))
---
SELECT "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", "38"]]
INSERT INTO "tags" ("created_at", "name", "photo_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 29 Aug 2013 07:17:06 UTC +00:00], ["name", "c tree"], ["photo_id", 38], ["updated_at", Thu, 29 Aug 2013 07:17:06 UTC +00:00]]