app/controllers/users_controller.rb

  def create
    @user = User.create(user_params)
---
INSERT INTO "users" ("created_at", "updated_at", "username") VALUES (?, ?, ?)  [["created_at", Mon, 26 Aug 2013 09:32:33 UTC +00:00], ["updated_at", Mon, 26 Aug 2013 09:32:33 UTC +00:00], ["username", "raghav"]]